Revit 2024 API
BuiltInFailures.EditingFailures.CannotMoveHereInViewError Property
 Can't move here at this view angle. Set another Work Plane or adjust the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotMoveHereInViewError { get; }
Visual Basic
Public Shared ReadOnly Property CannotMoveHereInViewError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotMoveHereInViewError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace